spot/doc/userdoc/install.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Installing Spot</title>
<!-- 2018-01-20 Sat 14:20 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
<meta  name="description" content="Different ways to install the Spot package"
 />
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="spot.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Installing Spot</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Installing from a tarball</a>
<ul>
<li><a href="#sec-1-1">Requirements</a></li>
<li><a href="#sec-1-2">Installation</a></li>
</ul>
</li>
<li><a href="#sec-2">Installing the Debian packages</a></li>
<li><a href="#sec-3">Installing from git</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Installing from a tarball</h2>
<div class="outline-text-2" id="text-1">
<p>
The latest release of Spot is version 2.5:
</p>

<ul class="org-ul">
<li><a href="http://www.lrde.epita.fr/dload/spot/spot-2.5.tar.gz"><code>spot-2.5.tar.gz</code></a> (see also the <a href="https://gitlab.lrde.epita.fr/spot/spot/blob/spot-2-5/NEWS">summary of the changes</a>)
</li>
</ul>

<p>
Past releases can be found <a href="https://www.lrde.epita.fr/dload/spot/">in the same directory</a>.  If you are
interested in <i>future</i> releases, you can always peek at the <a href="http://teamcity.lrde.epita.fr/viewLog.html?buildTypeId=bt16&buildId=lastFinished&buildBranch=next&tab=artifacts&guest=1">last
successful development build</a>.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Requirements</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Spot requires a C++14-compliant compiler.  <code>g++</code> 5.0 or later, as well
as <code>clang++</code> 3.5 or later should work.
</p>

<p>
Spot expects a complete installation of Python (version 3.3 or later).
Especially, Python's headers files should be installed.  If you don't
have Python installed, and do NOT want to install it, you should run
<code>./configure</code> with the <code>--disable-python</code> option.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Installation</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The installation follows the usual <code>./configure</code>, <code>make</code>, <code>make install</code> steps.
</p>

<p>
Please <b>do</b> install Spot somewhere: while skipping <code>make install</code> and
running the command-line tools directly from the build directory
should work, it will be slower than if you run <code>make install</code> and run
the installed binaries.
</p>

<p>
By default, <code>make install</code> will install everything under
<code>/usr/local/</code>, so unless you have write access to this directory you
will either have to run <code>sudo make install</code>, or choose another
installation prefix.
</p>

<p>
For instance to install Spot in <code>~/usr</code> (i.e., in your home
directory), use
</p>

<div class="org-src-container">

<pre class="src src-sh">./configure --prefix ~/usr
make
make install
</pre>
</div>

<p>
Files <code>INSTALL</code> and <code>README</code> included in the tarball contains more
explanations about the various options you can use during this
process.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Installing the Debian packages</h2>
<div class="outline-text-2" id="text-2">
<p>
We build Debian packages for amd64 and i386, for both releases and the
development versions.  Packages for releases are built for Debian
Stretch (a.k.a. Debian stable) while packages for development are built
for Sid (a.k.a. Debian unstable).
</p>

<p>
Here is how to install the stable packages:
</p>

<div class="org-src-container">

<pre class="src src-sh">wget -q -O - https://www.lrde.epita.fr/repo/debian.gpg | apt-key add -
<span class="org-builtin">echo</span> <span class="org-string">'deb http://www.lrde.epita.fr/repo/debian/ stable/'</span> &gt;&gt; /etc/apt/sources.list
apt-get update
apt-get install spot libspot-dev spot-doc python3-spot <span class="org-comment-delimiter"># </span><span class="org-comment">Or a subset of those</span>
</pre>
</div>

<p>
Here is how to install the unstable packages:
</p>

<div class="org-src-container">

<pre class="src src-sh">wget -q -O - https://www.lrde.epita.fr/repo/debian.gpg | apt-key add -
<span class="org-builtin">echo</span> <span class="org-string">'deb http://www.lrde.epita.fr/repo/debian/ unstable/'</span> &gt;&gt; /etc/apt/sources.list
apt-get update
apt-get install spot libspot-dev spot-doc python3-spot <span class="org-comment-delimiter"># </span><span class="org-comment">Or a subset of those</span>
</pre>
</div>

<p>
Note that our Debian repository is signed since that is the new Debian
policy, and both of the above command blocks start with a download of
our <a href="https://www.lrde.epita.fr/repo/debian.gpg">GPG key</a>.  Its fingerprint is <code>209B 7362 CFD6 FECF B41D 717F 03D9
9E74 44F2 A84A</code>, if you want to verify it.
</p>

<p>
The package <code>spot</code> contains the <a href="tools.html">command-line tools</a>. <code>libspot-dev</code>
contains the header files if you plan to use Spot in a C++14
program. <code>spot-doc</code> contains some html (including these pages) and pdf
documentation. Finally <code>python3-spot</code> contains some Python bindings
(this package also installs some ipython notebooks that you can use as
examples).  The packages containing the libraries (<code>libspot0</code>,
<code>libbddx0</code>, <code>libspotltsmin0</code>) are automatically installed as
dependencies of the previous packages.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Installing from git</h2>
<div class="outline-text-2" id="text-3">
<p>
The <code>master</code> branch of the git repository contains the code for the
latest released version, possibly with a few yet-to-be-released
bugfixes.  The <code>next</code> branch is the main development branch, and contains
the (working) code that should be part of the next major release.
</p>

<p>
To clone the git repository, use
</p>

<div class="org-src-container">

<pre class="src src-sh">git clone https://gitlab.lrde.epita.fr/spot/spot.git
</pre>
</div>

<p>
This should put you on the <code>next</code> branch by default.  From there, read
the <a href="https://gitlab.lrde.epita.fr/spot/spot/blob/next/HACKING">HACKING</a> file that should be at the top of your cloned repository:
it lists all the tools you should install before attempting to compile
the source tree.
</p>
</div>
</div>
</div>
</body>
</html>
